#include <iostream>
using namespace std;

int main() {
	 /*Напишіть програму, яка створює двовимірний
	масив і заповнює його за таким принципом: користувач
	вводить число (наприклад, 3) перший елемент масиву
	приймає значення цього числа, наступний елемент масиву приймає значення цього числа помноженого на 2
	(тобто 6 для нашого прикладу), третій елемент масиву —
	попередній елемент помножений на 2 (тобто 6*2=12 для
	нашого прикладу). Створений масив вивести на екран.*/
    const int ROWS = 3;  
    const int COLS = 4; 

    int arr[ROWS][COLS];
    int num;

   /* cout << "Enter number for start: ";
    cin >> num;

    arr[0][0] = num; 

    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLS; j++) {
            if (i == 0 && j == 0) continue; 
            if (j == 0)
                arr[i][j] = arr[i - 1][COLS - 1] * 2; 
            else
                arr[i][j] = arr[i][j - 1] * 2; 
        }
    }

    cout << "Array :: ";
    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLS; j++) {
            cout << arr[i][j] << " ";
        }
        cout << endl;
    }*/

    /*Напишіть програму, яка створює двовимірний
    масив і заповнює його за таким принципом: користувач
    вводить число (наприклад, 3) перший елемент масиву
    приймає значення цього числа, наступний елемент масиву
    приймає значення цього числа + 1 (тобто 4 для нашого
    прикладу), третій елемент масиву — попередній елемент
    + 1 (тобто 5 для нашого прикладу). Створений масив
    вивести на екран.*/
    
    cout << "Enter number for start: ";
    cin >> num;

    arr[0][0] = num;

    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLS; j++) {
            if (i == 0 && j == 0) continue; 
            if (j == 0)
                arr[i][j] = arr[i - 1][COLS - 1] + 1; 
            else
                arr[i][j] = arr[i][j - 1] + 1; 
        }
    }

    cout << "Array --> ";
    for (int i = 0; i < ROWS; i++) {
        for (int j = 0; j < COLS; j++) {
            cout << arr[i][j] << endl;
        }
        cout << endl;
    }

}
